In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('us_cities_by_state_SEPT.2023.csv')

In [5]:
df = df.groupby('state', as_index = False).size()

In [6]:
df = df.rename(columns={df.columns[0]: 'STATE', df.columns[1]: 'ARTICLES'})

In [7]:
df.head()

        STATE  ARTICLES
0     Alabama       922
1      Alaska       149
2     Arizona        91
3    Arkansas       500
4  California       482

In [8]:
population = pd.read_csv('population_by_state.csv')

In [9]:
population.head()

        STATE  POPULATION
0     Alabama   5074296.0
1      Alaska    733583.0
2     Arizona   7359197.0
3    Arkansas   3045637.0
4  California  39029342.0

In [10]:
statewise_total_articles = pd.merge(df, population, on = "STATE")

In [11]:
statewise_total_articles['total_articles_per_capita'] = statewise_total_articles['ARTICLES'] / statewise_total_articles['POPULATION']

In [12]:
statewise_total_articles.head()

        STATE  ARTICLES  POPULATION  total_articles_per_capita
0     Alabama       922   5074296.0                   0.000182
1      Alaska       149    733583.0                   0.000203
2     Arizona        91   7359197.0                   0.000012
3    Arkansas       500   3045637.0                   0.000164
4  California       482  39029342.0                   0.000012

### Table 1

In [13]:
statewise_total_articles.sort_values(['total_articles_per_capita'], ascending=[0]).head(10)

           STATE  ARTICLES  POPULATION  total_articles_per_capita
32       Vermont       329    647064.0                   0.000508
16         Maine       483   1385340.0                   0.000349
12          Iowa      1043   3200517.0                   0.000326
1         Alaska       149    733583.0                   0.000203
28  Pennsylvania      2556  12972008.0                   0.000197
0        Alabama       922   5074296.0                   0.000182
19      Michigan      1773  10034113.0                   0.000177
36       Wyoming        99    581381.0                   0.000170
3       Arkansas       500   3045637.0                   0.000164
22      Missouri       951   6177957.0                   0.000154

### Table 2

In [19]:
statewise_total_articles.sort_values(['total_articles_per_capita'], ascending=[0]).tail(10).iloc[::-1]

         STATE  ARTICLES  POPULATION  total_articles_per_capita
24      Nevada        19   3177772.0                   0.000006
4   California       482  39029342.0                   0.000012
2      Arizona        91   7359197.0                   0.000012
7      Florida       413  22244823.0                   0.000019
26    Oklahoma        75   4019800.0                   0.000019
13      Kansas        63   2937150.0                   0.000021
17    Maryland       157   6164660.0                   0.000025
33    Virginia       266   8683619.0                   0.000031
35   Wisconsin       193   5892539.0                   0.000033
34  Washington       281   7785786.0                   0.000036

### Table 3 and 4 need article quality as well

### Table 5

### Table 6